[
    {
        "movieID": 1,
        "title": "Toy Story 4",
        "rating": "77.0",
        "genres": [
            "Adventure",
            "Animation",
            "Comedy",
            "Family"
        ],
        "duration": "1h 40m",
        "releaseDate": "June 11, 2019",
        "description": "Woody has always been confident about his place in the world and that his priority is taking care of his kid, whether that's Andy or Bonnie. But when Bonnie adds a reluctant new toy called \"Forky\" to her room, a road trip adventure alongside old and new friends will show Woody how big the world can be for a toy.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/w9kR8qbmQ01HwnvK4alvnQ2ca0L.jpg"
    },
    {
        "movieID": 2,
        "title": "Dark Phoenix",
        "rating": "61.0",
        "genres": [
            "Action",
            "Adventure",
            "Science Fiction"
        ],
        "duration": "1h 54m",
        "releaseDate": "June 7, 2019",
        "description": "The X-Men face their most formidable and powerful foe when one of their own, Jean Grey, starts to spiral out of control. During a rescue mission in outer space, Jean is nearly killed when she's hit by a mysterious cosmic force. Once she returns home, this force not only makes her infinitely more powerful, but far more unstable. The X-Men must now band together to save her soul and battle aliens that want to use Grey's new abilities to rule the galaxy.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/cCTJPelKGLhALq3r51A9uMonxKj.jpg"
    },
    {
        "movieID": 3,
        "title": "Godzilla: King of the Monsters",
        "rating": "61.0",
        "genres": [
            "Action",
            "Science Fiction"
        ],
        "duration": "2h 12m",
        "releaseDate": "May 31, 2019",
        "description": "Follows the heroic efforts of the crypto-zoological agency Monarch as its members face off against a battery of god-sized monsters, including the mighty Godzilla, who collides with Mothra, Rodan, and his ultimate nemesis, the three-headed King Ghidorah. When these ancient super-species - thought to be mere myths - rise again, they all vie for supremacy, leaving humanity's very existence hanging in the balance.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/fQ40gmFM4p03tXwMxQQKh2cCBW4.jpg"
    },
    {
        "movieID": 4,
        "title": "Fast & Furious Presents: Hobbs & Shaw",
        "rating": "65.0",
        "genres": [
            "Action"
        ],
        "duration": "2h 16m",
        "releaseDate": "July 13, 2019",
        "description": "A spinoff of The Fate of the Furious, focusing on Johnson's US Diplomatic Security Agent Luke Hobbs forming an unlikely alliance with Statham's Deckard Shaw.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/keym7MPn1icW1wWfzMnW3HeuzWU.jpg"
    },
    {
        "movieID": 5,
        "title": "Ad Astra",
        "rating": "62.0",
        "genres": [
            "Adventure",
            "Drama",
            "Mystery",
            "Science Fiction",
            "Thriller"
        ],
        "duration": "2h 4m",
        "releaseDate": "September 20, 2019",
        "description": "An astronaut travels to the outer edges of the solar system to find his father and unravel a mystery that threatens the survival of our planet. He uncovers secrets which challenge the nature of human existence and our place in the cosmos.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/6e1P7OVSQT4O2h6vnJiOj90s7gT.jpg"
    },
    {
        "movieID": 6,
        "title": "Aladdin",
        "rating": "71.0",
        "genres": [
            "Adventure",
            "Comedy",
            "Family",
            "Fantasy",
            "Romance"
        ],
        "duration": "2h 8m",
        "releaseDate": "May 24, 2019",
        "description": "A kindhearted street urchin named Aladdin embarks on a magical adventure after finding a lamp that releases a wisecracking genie while a power-hungry Grand Vizier vies for the same lamp that has the power to make their deepest wishes come true.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/3iYQTLGoy7QnjcUYRJy4YrAgGvp.jpg"
    },
    {
        "movieID": 7,
        "title": "The Lion King",
        "rating": "72.0",
        "genres": [
            "Action",
            "Adventure",
            "Animation",
            "Drama",
            "Family"
        ],
        "duration": "1h 58m",
        "releaseDate": "July 19, 2019",
        "description": "Simba idolises his father, King Mufasa, and takes to heart his own royal destiny. But not everyone in the kingdom celebrates the new cub's arrival. Scar, Mufasa's brother—and former heir to the throne—has plans of his own. The battle for Pride Rock is ravaged with betrayal, tragedy and drama, ultimately resulting in Simba's exile. With help from a curious pair of newfound friends, Simba will have to figure out how to grow up and take back what is rightfully his.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/2bXbqYdUdNVa8VIWXVfclP2ICtT.jpg"
    },
    {
        "movieID": 8,
        "title": "Angel Has Fallen",
        "rating": "56.0",
        "genres": [
            "Action"
        ],
        "duration": "2h 1m",
        "releaseDate": "August 23, 2019",
        "description": "Secret Service Agent Mike Banning is framed for the attempted assassination of the President and must evade his own agency and the FBI as he tries to uncover the real threat.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/fapXd3v9qTcNBTm39ZC4KUVQDNf.jpg"
    },
    {
        "movieID": 9,
        "title": "The Old Man & the Gun",
        "rating": "64.0",
        "genres": [
            "Comedy",
            "Crime",
            "Drama"
        ],
        "duration": "1h 33m",
        "releaseDate": "August 31, 2018",
        "description": "The true story of Forrest Tucker, from his audacious escape from San Quentin at the age of 70 to an unprecedented string of heists that confounded authorities and enchanted the public. Wrapped up in the pursuit are a detective, who becomes captivated with Forrest’s commitment to his craft, and a woman, who loves him in spite of his chosen profession.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/a4BfxRK8dBgbQqbRxPs8kmLd8LG.jpg"
    },
    {
        "movieID": 10,
        "title": "Spider-Man: Far from Home",
        "rating": "77.0",
        "genres": [
            "Action",
            "Adventure",
            "Science Fiction"
        ],
        "duration": "2h 9m",
        "releaseDate": "June 26, 2019",
        "description": "Peter Parker and his friends go on a summer trip to Europe. However, they will hardly be able to rest - Peter will have to agree to help Nick Fury uncover the mystery of creatures that cause natural disasters and destruction throughout the continent.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/lcq8dVxeeOqHvvgcte707K0KVx5.jpg"
    },
    {
        "movieID": 11,
        "title": "John Wick: Chapter 3 – Parabellum",
        "rating": "71.0",
        "genres": [
            "Action",
            "Crime",
            "Thriller"
        ],
        "duration": "2h 11m",
        "releaseDate": "May 9, 2019",
        "description": "Super-assassin John Wick returns with a $14 million price tag on his head and an army of bounty-hunting killers on his trail. After killing a member of the shadowy international assassin’s guild, the High Table, John Wick is excommunicado, but the world’s most ruthless hit men and women await his every turn.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/ziEuG1essDuWuC5lpWUaw1uXY2O.jpg"
    },
    {
        "movieID": 12,
        "title": "It Chapter Two",
        "rating": "72.0",
        "genres": [
            "Comedy",
            "Horror"
        ],
        "duration": "2h 49m",
        "releaseDate": "September 6, 2019",
        "description": "27 years after overcoming the malevolent supernatural entity Pennywise, the former members of the Losers' Club, who have grown up and moved away from Derry, are brought back together by a devastating phone call.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/zfE0R94v1E8cuKAerbskfD3VfUt.jpg"
    },
    {
        "movieID": 13,
        "title": "Anna",
        "rating": "65.0",
        "genres": [
            "Action",
            "Thriller"
        ],
        "duration": "1h 59m",
        "releaseDate": "June 21, 2019",
        "description": "Beneath Anna Poliatova's striking beauty lies a secret that will unleash her indelible strength and skill to become one of the world's most feared government assassins.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/hDpur5nBU27xACkQvm45utQgYJ7.jpg"
    },
    {
        "movieID": 14,
        "title": "Annabelle Comes Home",
        "rating": "61.0",
        "genres": [
            "Horror",
            "Mystery",
            "Thriller"
        ],
        "duration": "1h 46m",
        "releaseDate": "June 26, 2019",
        "description": "Determined to keep Annabelle from wreaking more havoc, demonologists Ed and Lorraine Warren bring the possessed doll to the locked artifacts room in their home, placing her “safely” behind sacred glass and enlisting a priest’s holy blessing. But an unholy night of horror awaits as Annabelle awakens the evil spirits in the room, who all set their sights on a new target—the Warrens' ten-year-old daughter, Judy, and her friends.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/qWsHMrbg9DsBY3bCMk9jyYCRVRs.jpg"
    },
    {
        "movieID": 15,
        "title": "Rambo: Last Blood",
        "rating": "67.0",
        "genres": [
            "Action",
            "Thriller"
        ],
        "duration": "1h 29m",
        "releaseDate": "September 20, 2019",
        "description": "When his housekeeper’s granddaughter is kidnapped, Rambo crosses the U.S.-Mexican border to bring her home but finds himself up against the full might of one of Mexico’s most ruthless cartels.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/maHr4ceIxkb22uJCFIvPgx0rZsq.jpg"
    },
    {
        "movieID": 16,
        "title": "Lisbela and the Prisoner",
        "rating": "77.0",
        "genres": [
            "Comedy",
            "Romance"
        ],
        "duration": "1h 46m",
        "releaseDate": "August 22, 2003",
        "description": "Lisbela is a young woman who loves going to the movies. Leléu is a con man, going from town to town selling all sort of things and performing as master of ceremonies for some cheesy numbers, such as the woman who gets transformed into a gorilla. He gets involved with Linaura, a sexy and beautiful woman who happens to be the wife of the most frightening hitman of the place. The hitman finds out his wife's affair and goes after Leléu, who has to leave in a hurry. In another town, he meets and falls instantly in love with Lisbela, who is engaged to Douglas, a hillbilly who tries hard to pass for a cosmopolitan Rio de Janeiro dweller.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/9nlaRxQeYaMrVVANMppagFohCRP.jpg"
    },
    {
        "movieID": 17,
        "title": "Child's Play",
        "rating": "59.0",
        "genres": [
            "Horror"
        ],
        "duration": "1h 30m",
        "releaseDate": "June 21, 2019",
        "description": "Karen, a single mother, gifts her son Andy a Buddi doll for his birthday, unaware of its more sinister nature. A contemporary re-imagining of the 1988 horror classic.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/rpS7ROczWulqfaXG2klYapULXKm.jpg"
    },
    {
        "movieID": 18,
        "title": "Hustlers",
        "rating": "64.0",
        "genres": [
            "Comedy",
            "Crime",
            "Drama"
        ],
        "duration": "1h 47m",
        "releaseDate": "September 13, 2019",
        "description": "A crew of savvy former strip club employees band together to turn the tables on their Wall Street clients.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/zBhv8rsLOfpFW2M5b6wW78Uoojs.jpg"
    },
    {
        "movieID": 19,
        "title": "L-DK: Two Loves, Under One Roof",
        "rating": "71.0",
        "genres": [
            "Romance"
        ],
        "duration": "1h 47m",
        "releaseDate": "March 21, 2019",
        "description": "Aoi Nishimori and Shusei Kugayama are in love and they begin to live together secretly. Suddenly, Shusei's cousin Reon Kugayama comes to them. Their secret is discovered by Reon. Now, Aoi, Shusei and Reon begin to live together.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/8L66hJyXptS9XBt5b4O7WkZuwYj.jpg"
    },
    {
        "movieID": 20,
        "title": "Cars",
        "rating": "67.0",
        "genres": [
            "Adventure",
            "Animation",
            "Comedy",
            "Family"
        ],
        "duration": "1h 57m",
        "releaseDate": "March 14, 2006",
        "description": "Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself unexpectedly detoured in the sleepy Route 66 town of Radiator Springs. On route across the country to the big Piston Cup Championship in California to compete against two seasoned pros, McQueen gets to know the town's offbeat characters.",
        "poster": "https://image.tmdb.org/t/p/w300_and_h450_bestv2/jpfkzbIXgKZqCZAkEkFH2VYF63s.jpg"
    }
]